; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-7nodes-1000size-3degree-100mindistance-3trucks-2packages-535seed

(define (problem transport-two-cities-sequential-7nodes-1000size-3degree-100mindistance-3trucks-2packages-535seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  city-1-loc-7 - location
  city-2-loc-7 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 627,395 -> 476,567
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 23)
  ; 476,567 -> 627,395
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 23)
  ; 191,904 -> 476,567
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 45)
  ; 476,567 -> 191,904
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 45)
  ; 508,797 -> 476,567
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 24)
  ; 476,567 -> 508,797
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 24)
  ; 508,797 -> 627,395
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 42)
  ; 627,395 -> 508,797
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 42)
  ; 508,797 -> 191,904
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 34)
  ; 191,904 -> 508,797
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 34)
  ; 940,215 -> 627,395
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 37)
  ; 627,395 -> 940,215
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 37)
  ; 849,26 -> 627,395
  (road city-1-loc-6 city-1-loc-2)
  (= (road-length city-1-loc-6 city-1-loc-2) 44)
  ; 627,395 -> 849,26
  (road city-1-loc-2 city-1-loc-6)
  (= (road-length city-1-loc-2 city-1-loc-6) 44)
  ; 849,26 -> 940,215
  (road city-1-loc-6 city-1-loc-5)
  (= (road-length city-1-loc-6 city-1-loc-5) 21)
  ; 940,215 -> 849,26
  (road city-1-loc-5 city-1-loc-6)
  (= (road-length city-1-loc-5 city-1-loc-6) 21)
  ; 729,784 -> 476,567
  (road city-1-loc-7 city-1-loc-1)
  (= (road-length city-1-loc-7 city-1-loc-1) 34)
  ; 476,567 -> 729,784
  (road city-1-loc-1 city-1-loc-7)
  (= (road-length city-1-loc-1 city-1-loc-7) 34)
  ; 729,784 -> 627,395
  (road city-1-loc-7 city-1-loc-2)
  (= (road-length city-1-loc-7 city-1-loc-2) 41)
  ; 627,395 -> 729,784
  (road city-1-loc-2 city-1-loc-7)
  (= (road-length city-1-loc-2 city-1-loc-7) 41)
  ; 729,784 -> 508,797
  (road city-1-loc-7 city-1-loc-4)
  (= (road-length city-1-loc-7 city-1-loc-4) 23)
  ; 508,797 -> 729,784
  (road city-1-loc-4 city-1-loc-7)
  (= (road-length city-1-loc-4 city-1-loc-7) 23)
  ; 2024,980 -> 2031,561
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 42)
  ; 2031,561 -> 2024,980
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 42)
  ; 2344,441 -> 2031,561
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 34)
  ; 2031,561 -> 2344,441
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 34)
  ; 2344,441 -> 2570,720
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 36)
  ; 2570,720 -> 2344,441
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 36)
  ; 2745,952 -> 2570,720
  (road city-2-loc-6 city-2-loc-2)
  (= (road-length city-2-loc-6 city-2-loc-2) 30)
  ; 2570,720 -> 2745,952
  (road city-2-loc-2 city-2-loc-6)
  (= (road-length city-2-loc-2 city-2-loc-6) 30)
  ; 2516,63 -> 2344,441
  (road city-2-loc-7 city-2-loc-4)
  (= (road-length city-2-loc-7 city-2-loc-4) 42)
  ; 2344,441 -> 2516,63
  (road city-2-loc-4 city-2-loc-7)
  (= (road-length city-2-loc-4 city-2-loc-7) 42)
  ; 2516,63 -> 2890,39
  (road city-2-loc-7 city-2-loc-5)
  (= (road-length city-2-loc-7 city-2-loc-5) 38)
  ; 2890,39 -> 2516,63
  (road city-2-loc-5 city-2-loc-7)
  (= (road-length city-2-loc-5 city-2-loc-7) 38)
  ; 940,215 <-> 2031,561
  (road city-1-loc-5 city-2-loc-1)
  (= (road-length city-1-loc-5 city-2-loc-1) 115)
  (road city-2-loc-1 city-1-loc-5)
  (= (road-length city-2-loc-1 city-1-loc-5) 115)
  (at package-1 city-1-loc-3)
  (at package-2 city-1-loc-1)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-5)
  (capacity truck-2 capacity-2)
  (at truck-3 city-2-loc-1)
  (capacity truck-3 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-2-loc-1 city-1-loc-5)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-1-loc-5)
   goals met: 0 of 2
2. (drive truck-3 city-1-loc-5 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-5)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 2
3. (drive truck-3 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 2
4. (pick-up truck-3 city-1-loc-1 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-1) (capacity truck-3 capacity-2)
   added: (in package-2 truck-3) (capacity truck-3 capacity-1)
   goals met: 0 of 2
5. (drive truck-3 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 2
6. (pick-up truck-3 city-1-loc-3 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-3) (capacity truck-3 capacity-1)
   added: (in package-1 truck-3) (capacity truck-3 capacity-0)
   goals met: 0 of 2
7. (drive truck-3 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 2
8. (drive truck-3 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 2
9. (drive truck-3 city-1-loc-2 city-1-loc-5)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-5)
   goals met: 0 of 2
10. (drive truck-3 city-1-loc-5 city-2-loc-1)
   deleted: (at truck-3 city-1-loc-5)
   added: (at truck-3 city-2-loc-1)
   goals met: 0 of 2
11. (drive truck-3 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-2-loc-3)
   goals met: 0 of 2
12. (drop truck-3 city-2-loc-3 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-0)
   added: (at package-1 city-2-loc-3) (capacity truck-3 capacity-1)
   goals met: 1 of 2
13. (drive truck-3 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-3 city-2-loc-3)
   added: (at truck-3 city-2-loc-1)
   goals met: 1 of 2
14. (drive truck-3 city-2-loc-1 city-2-loc-4)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-2-loc-4)
   goals met: 1 of 2
15. (drive truck-3 city-2-loc-4 city-2-loc-7)
   deleted: (at truck-3 city-2-loc-4)
   added: (at truck-3 city-2-loc-7)
   goals met: 1 of 2
16. (drive truck-3 city-2-loc-7 city-2-loc-5)
   deleted: (at truck-3 city-2-loc-7)
   added: (at truck-3 city-2-loc-5)
   goals met: 1 of 2
17. (drop truck-3 city-2-loc-5 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-1)
   added: (at package-2 city-2-loc-5) (capacity truck-3 capacity-2)
   goals met: 2 of 2
